1) Data Wrangling, I
Perform the following operations using Python on any open source dataset (e.g., data.csv)
1. Import all the required Python Libraries.
2. Locate open source data from the web (e.g., https://www.kaggle.com). Provide a clear
description of the data and its source (i.e., URL of the web site).
3. Load the Dataset into pandas dataframe.
4. Data Preprocessing: check for missing values in the data using pandas isnull(), describe()
function to get some initial statistics. Provide variable descriptions. Types of variables etc.
Check the dimensions of the data frame.
5. Data Formatting and Data Normalization: Summarize the types of variables by checking the
data types (i.e., character, numeric, integer, factor, and logical) of the variables in the data set.
If variables are not in the correct data type, apply proper type conversions.
6. Turn categorical variables into quantitative variables in Python.

In [188]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [189]:
df =pd.read_csv("data.csv")

In [190]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [191]:
df.shape

(891, 12)

In [192]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [193]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [194]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [195]:
df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [196]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [197]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [198]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [199]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [200]:
df['Cabin'].fillna(df['Cabin'].mode()[0],inplace=True)

In [201]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [202]:
df.dropna(subset='Embarked' , inplace=True)

In [203]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [204]:
np.round(df.describe(),2)

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count        889.0    889.00  889.00  889.00  889.00  889.00  889.00
mean         446.0      0.38    2.31   29.65    0.52    0.38   32.10
std          257.0      0.49    0.83   12.97    1.10    0.81   49.70
min            1.0      0.00    1.00    0.42    0.00    0.00    0.00
25%          224.0      0.00    2.00   22.00    0.00    0.00    7.90
50%          446.0      0.00    3.00   29.70    0.00    0.00   14.45
75%          668.0      1.00    3.00   35.00    1.00    0.00   31.00
max          891.0      1.00    3.00   80.00    8.00    6.00  512.33

In [205]:
# data transformation

In [206]:
X =df.drop(columns=['PassengerId' , 'Survived' ,'Ticket' 'Name'] )
y= df['Survived']

In [207]:
from sklearn.model_selection import train_test_split
X_train  , X_test , Y_train , Y_test = train_test_split(X , y , test_size=0.20 ,random_state=43)

In [208]:
from sklearn.preprocessing import OneHotEncoder

In [209]:
OHE =OneHotEncoder(drop ='first' ,sparse =False ,dtype= np.int32)

In [210]:
X_train_new = OHE.fit_transform(X_train[['Sex' ,'Embarked']])

C:\Users\solan\anaconda1\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [211]:
X_test_new = OHE.fit_transform(X_test[['Sex' ,'Embarked']])

C:\Users\solan\anaconda1\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [212]:
X_train_new.shape

(711, 3)

In [214]:
np.hstack((X_train[['Embarked']].values , X_train_new))

array([['S', 1, 0, 1],
       ['C', 1, 0, 0],
       ['Q', 1, 1, 0],
       ...,
       ['C', 0, 0, 0],
       ['S', 1, 0, 1],
       ['S', 1, 0, 1]], dtype=object)